Current/Product/Production/Common/ConnectionManagerCA/test/GetAllBusinessEntitiesByServiceName/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:gov:hhs:fha:nhinc:common:connectionmanagerinfo">
  <soapenv:Body>
    <urn:GetAllBusinessEntitySetByServiceNameRequest>
      <!--Optional:-->
      <urn:serviceName>subjectdiscovery</urn:serviceName>
    </urn:GetAllBusinessEntitySetByServiceNameRequest>
  </soapenv:Body>
</soapenv:Envelope>